# NotEnoughSlotsOnlyLugAvailable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..NotEnoughSlotsOnlyLugAvailable Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
There aren't enough slots on panel [Panel Name], so the circuit will connect through Feed Through Lugs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NotEnoughSlotsOnlyLugAvailable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NotEnoughSlotsOnlyLugAvailable As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NotEnoughSlotsOnlyLugAvailable {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace